###### Python Datetime

In [1]:
from datetime import datetime

In [2]:
my_year = 2025
my_month = 9
my_day = 15
my_hour = 18
my_minute = 52
my_second = 20

In [5]:
my_date = datetime(my_year, my_month, my_day, my_hour, my_minute, my_second)

In [6]:
my_date

datetime.datetime(2025, 9, 15, 18, 52, 20)

In [7]:
type(my_date)

datetime.datetime

In [9]:
my_date.isoweekday()

1

In [10]:
my_date.weekday()

0

###### Pandas

In [11]:
import pandas as pd

In [12]:
myser = pd.Series(['Nov 3, 2025','2000-01-01', None])

In [13]:
myser

0    Nov 3, 2025
1     2000-01-01
2           None
dtype: object

In [14]:
myser[0]

'Nov 3, 2025'

In [15]:
pd.to_datetime(myser,format='mixed')

0   2025-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [16]:
pd.to_datetime(myser,format='mixed')[0]

Timestamp('2025-11-03 00:00:00')

In [19]:
complex_date = '10-12-2025'

In [20]:
pd.to_datetime(complex_date,dayfirst=False)

Timestamp('2025-10-12 00:00:00')

###### Custom Time String 

https://docs.python.org/3/library/datetime.html#strftime-and-strptime-format-codes

In [21]:
stylish_date = '12th$!~-Dec +=^ 2025'

In [23]:
pd.to_datetime(stylish_date,format='%dth$!~-%b +=^ %Y')

Timestamp('2025-12-12 00:00:00')

###### Data

In [25]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [26]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [28]:
sales.iloc[4]['DATE']

'1992-05-01'

In [29]:
type(sales.iloc[4]['DATE'])

str

In [30]:
sales['DATE'] = pd.to_datetime(sales['DATE'])
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [31]:
type(sales.iloc[4]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html

In [34]:
sales['Month'] = sales['DATE'].dt.month

In [36]:
sales.sample(5)

          DATE  MRTSSM4453USN  Month
176 2006-09-01           2997      9
17  1993-06-01           1792      6
136 2003-05-01           2576      5
36  1995-01-01           1555      1
313 2018-02-01           3992      2

In [38]:
sales['DATE'].dt.month_name()

0       January
1      February
2         March
3         April
4           May
         ...
335    December
336     January
337    February
338       March
339       April
Name: DATE, Length: 340, dtype: object

In [39]:
sales['DATE'].dt.is_leap_year

0       True
1       True
2       True
3       True
4       True
       ...
335    False
336     True
337     True
338     True
339     True
Name: DATE, Length: 340, dtype: bool

In [40]:
sales['DATE'].dt.day_name()

0      Wednesday
1       Saturday
2         Sunday
3      Wednesday
4         Friday
         ...
335       Sunday
336    Wednesday
337     Saturday
338       Sunday
339    Wednesday
Name: DATE, Length: 340, dtype: object